import pandas as pd

In [30]:
df = pd.DataFrame({
    "Name":["Vero","Jane","Alice"],
    "Location":["Nairobi","Kisumu","Mombasa"],
    Age:[20,30,40]
})

NameError: name 'Age' is not defined

In [31]:
df= pd.DataFrame({
    "Name":["Vero","Jane","Alice"],
    "Location":["Nairobi","Kisumu","Mombasa"],
    "Age":[20,30,40]
})

In [32]:
df

    Name Location  Age
0   Vero  Nairobi   20
1   Jane   Kisumu   30
2  Alice  Mombasa   40

In [33]:
 sr=pd.series(["Vero","Jane","Alice"]),name="Names"

SyntaxError: cannot assign to function call (Temp/ipykernel_12320/3642670039.py, line 1)

In [ ]:
 sr=pd.series(["Vero","Jane","Alice"]),name="Names"

In [ ]:
sr

In [ ]:
 sr=pd.Series(["Vero","Jane","Alice"]),name="Names"

In [ ]:
sr

In [ ]:
 sr=pd.series(["Vero","Jane","Alice"],name="Names", index=["a","b","c"])

In [ ]:
pd.Series(["Vero","Jane","Alice"],name="Names", index=["a","b","c"])

In [35]:
df=pd.read_csv("houseprices.csv")

In [36]:
df

,city,area,rooms,bathroom,parking spaces,floor,animal,furniture,hoa (R$),rent amount (R$),property tax (R$),fire insurance (R$),total (R$)
0,São Paulo,70,2,1,1,7,acept,furnished,2065,3300,211,42,5618
1,São Paulo,320,4,4,0,20,acept,not furnished,1200,4960,1750,63,7973
2,Porto Alegre,80,1,1,1,6,acept,not furnished,1000,2800,0,41,3841
3,Porto Alegre,51,2,1,0,2,acept,not furnished,270,1112,22,17,1421
4,São Paulo,25,1,1,0,1,not acept,not furnished,0,800,25,11,836
...,...,...,...,...,...,...,...,...,...,...,...,...,...
10687,Porto Alegre,63,2,1,1,5,not acept,furnished,402,1478,24,22,1926
10688,São Paulo,285,4,4,4,17,acept,not furnished,3100,15000,973,191,19260
10689,Rio de Janeiro,70,3,3,0,8,not acept,furnished,980,6000,332,78,7390
10690,Rio de Janeiro,120,2,2,2,8,acept,furnished,1585,12000,279,155,14020
10691,São Paulo,80,2,1,0,-,acept,not furnished,0,1400,165,22,1587

In [37]:
df.head(2)

,city,area,rooms,bathroom,parking spaces,floor,animal,furniture,hoa (R$),rent amount (R$),property tax (R$),fire insurance (R$),total (R$)
0,São Paulo,70,2,1,1,7,acept,furnished,2065,3300,211,42,5618
1,São Paulo,320,4,4,0,20,acept,not furnished,1200,4960,1750,63,7973

In [38]:
df.tail(3
       )

,city,area,rooms,bathroom,parking spaces,floor,animal,furniture,hoa (R$),rent amount (R$),property tax (R$),fire insurance (R$),total (R$)
10689,Rio de Janeiro,70,3,3,0,8,not acept,furnished,980,6000,332,78,7390
10690,Rio de Janeiro,120,2,2,2,8,acept,furnished,1585,12000,279,155,14020
10691,São Paulo,80,2,1,0,-,acept,not furnished,0,1400,165,22,1587

In [39]:
df.shape()

TypeError: 'tuple' object is not callable

In [40]:
df.shape

(10692, 13)

In [41]:
df.dtypes

city                   object
area                    int64
rooms                   int64
bathroom                int64
parking spaces          int64
floor                  object
animal                 object
furniture              object
hoa (R$)                int64
rent amount (R$)        int64
property tax (R$)       int64
fire insurance (R$)     int64
total (R$)              int64
dtype: object

In [42]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10692 entries, 0 to 10691
Data columns (total 13 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   city                 10692 non-null  object
 1   area                 10692 non-null  int64
 2   rooms                10692 non-null  int64
 3   bathroom             10692 non-null  int64
 4   parking spaces       10692 non-null  int64
 5   floor                10692 non-null  object
 6   animal               10692 non-null  object
 7   furniture            10692 non-null  object
 8   hoa (R$)             10692 non-null  int64
 9   rent amount (R$)     10692 non-null  int64
 10  property tax (R$)    10692 non-null  int64
 11  fire insurance (R$)  10692 non-null  int64
 12  total (R$)           10692 non-null  int64
dtypes: int64(9), object(4)
memory usage: 1.1+ MB

df.column

In [43]:
df.column

AttributeError: 'DataFrame' object has no attribute 'column'

In [44]:
df.columns

Index(['city', 'area', 'rooms', 'bathroom', 'parking spaces', 'floor',
       'animal', 'furniture', 'hoa (R$)', 'rent amount (R$)',
       'property tax (R$)', 'fire insurance (R$)', 'total (R$)'],
      dtype='object')

In [45]:
df.describe()

,area,rooms,bathroom,parking spaces,hoa (R$),rent amount (R$),property tax (R$),fire insurance (R$),total (R$)
count,10692.000000,10692.000000,10692.000000,10692.000000,1.069200e+04,10692.000000,10692.000000,10692.000000,1.069200e+04
mean,149.217920,2.506079,2.236813,1.609147,1.174022e+03,3896.247194,366.704358,53.300879,5.490487e+03
std,537.016942,1.171266,1.407198,1.589521,1.559231e+04,3408.545518,3107.832321,47.768031,1.648473e+04
min,11.000000,1.000000,1.000000,0.000000,0.000000e+00,450.000000,0.000000,3.000000,4.990000e+02
25%,56.000000,2.000000,1.000000,0.000000,1.700000e+02,1530.000000,38.000000,21.000000,2.061750e+03
50%,90.000000,2.000000,2.000000,1.000000,5.600000e+02,2661.000000,125.000000,36.000000,3.581500e+03
75%,182.000000,3.000000,3.000000,2.000000,1.237500e+03,5000.000000,375.000000,68.000000,6.768000e+03
max,46335.000000,13.000000,10.000000,12.000000,1.117000e+06,45000.000000,313700.000000,677.000000,1.120000e+06

In [46]:
df.memory_usage()

Index                    128
city                   85536
area                   85536
rooms                  85536
bathroom               85536
parking spaces         85536
floor                  85536
animal                 85536
furniture              85536
hoa (R$)               85536
rent amount (R$)       85536
property tax (R$)      85536
fire insurance (R$)    85536
total (R$)             85536
dtype: int64

In [47]:
df.max()

city                       São Paulo
area                           46335
rooms                             13
bathroom                          10
parking spaces                    12
floor                              9
animal                     not acept
furniture              not furnished
hoa (R$)                     1117000
rent amount (R$)               45000
property tax (R$)             313700
fire insurance (R$)              677
total (R$)                   1120000
dtype: object

In [48]:
df.min()

city                   Belo Horizonte
area                               11
rooms                               1
bathroom                            1
parking spaces                      0
floor                               -
animal                          acept
furniture                   furnished
hoa (R$)                            0
rent amount (R$)                  450
property tax (R$)                   0
fire insurance (R$)                 3
total (R$)                        499
dtype: object

In [49]:
df.mean()

C:\Users\BEATRI~1\AppData\Local\Temp/ipykernel_12320/3698961737.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

area                    149.217920
rooms                     2.506079
bathroom                  2.236813
parking spaces            1.609147
hoa (R$)               1174.021698
rent amount (R$)       3896.247194
property tax (R$)       366.704358
fire insurance (R$)      53.300879
total (R$)             5490.487000
dtype: float64

In [50]:
df.median()

C:\Users\BEATRI~1\AppData\Local\Temp/ipykernel_12320/530051474.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.median()

area                     90.0
rooms                     2.0
bathroom                  2.0
parking spaces            1.0
hoa (R$)                560.0
rent amount (R$)       2661.0
property tax (R$)       125.0
fire insurance (R$)      36.0
total (R$)             3581.5
dtype: float64

In [51]:
df.quantile()

area                     90.0
rooms                     2.0
bathroom                  2.0
parking spaces            1.0
hoa (R$)                560.0
rent amount (R$)       2661.0
property tax (R$)       125.0
fire insurance (R$)      36.0
total (R$)             3581.5
Name: 0.5, dtype: float64

In [52]:
df.head(3)

,city,area,rooms,bathroom,parking spaces,floor,animal,furniture,hoa (R$),rent amount (R$),property tax (R$),fire insurance (R$),total (R$)
0,São Paulo,70,2,1,1,7,acept,furnished,2065,3300,211,42,5618
1,São Paulo,320,4,4,0,20,acept,not furnished,1200,4960,1750,63,7973
2,Porto Alegre,80,1,1,1,6,acept,not furnished,1000,2800,0,41,3841

In [56]:
sepallLength=df.sepallLengthCm

AttributeError: 'DataFrame' object has no attribute 'sepallLengthCm'

In [57]:
sepallLength

0         70
1        320
2         80
3         51
4         25
        ...
10687     63
10688    285
10689     70
10690    120
10691     80
Name: area, Length: 10692, dtype: int64

In [58]:
df.mean()

C:\Users\BEATRI~1\AppData\Local\Temp/ipykernel_12320/3698961737.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

area                    149.217920
rooms                     2.506079
bathroom                  2.236813
parking spaces            1.609147
hoa (R$)               1174.021698
rent amount (R$)       3896.247194
property tax (R$)       366.704358
fire insurance (R$)      53.300879
total (R$)             5490.487000
dtype: float64

In [59]:
df= pd.DataFrame({
    "Name":["Vero","Jane","Alice"],
    "Location":["Nairobi","Kisumu","Mombasa"],
    "Age":[20,30,40]
})

In [60]:
df

    Name Location  Age
0   Vero  Nairobi   20
1   Jane   Kisumu   30
2  Alice  Mombasa   40

In [61]:
df.iloc[0]

Name           Vero
Location    Nairobi
Age              20
Name: 0, dtype: object

In [62]:
df.iloc[1,1]

'Kisumu'

In [63]:
df.iloc[:, 1:2]

  Location
0  Nairobi
1   Kisumu
2  Mombasa

In [64]:
df= pd.DataFrame({
    "Name":["Vero","Jane","Alice"],
    "Location":["Nairobi","Kisumu","Mombasa"],
    "Age":[20,30,40]
},index=["a","b","c"])

In [65]:
df

    Name Location  Age
a   Vero  Nairobi   20
b   Jane   Kisumu   30
c  Alice  Mombasa   40

In [67]:
df.loc["a":"b","Location"]

a    Nairobi
b     Kisumu
Name: Location, dtype: object

In [71]:
df.loc[:, "Age"]

a    20
b    30
c    40
Name: Age, dtype: int64

In [74]:
df.loc[:, "Age"].gt(21)

a    False
b     True
c     True
Name: Age, dtype: bool

In [75]:
df.loc[:,"Age"].lt(30)

a     True
b    False
c    False
Name: Age, dtype: bool

In [76]:
df.loc[:,"Age"].ge(30)

a    False
b     True
c     True
Name: Age, dtype: bool

In [85]:
df.loc[:,"Age"].eq(30)

a    False
b     True
c    False
Name: Age, dtype: bool

In [84]:
df.loc[:,"Age"].add(3)

a    23
b    33
c    43
Name: Age, dtype: int64

In [86]:
df[df.loc[:,"Age"].add(3)]

KeyError: "None of [Int64Index([23, 33, 43], dtype='int64')] are in the [columns]"

In [90]:
import numpy as np

In [126]:
df= pd.DataFrame({
    "Name":[np.NaN,"Jane","Alice"],
    "Location":["Nairobi",np.NaN,"_"],
    "Age":[20,30,np.NaN]
},index=["a","b","c"])

In [127]:
df

    Name Location   Age
a    NaN  Nairobi  20.0
b   Jane      NaN  30.0
c  Alice        _   NaN

In [128]:
df.isna()

    Name  Location    Age
a   True     False  False
b  False      True  False
c  False     False   True

In [129]:
df.replace("_",np.NaN)

    Name Location   Age
a    NaN  Nairobi  20.0
b   Jane      NaN  30.0
c  Alice      NaN   NaN

In [130]:
df["Location"]=df["Location"].fillna("msa")

In [131]:
df

    Name Location   Age
a    NaN  Nairobi  20.0
b   Jane      msa  30.0
c  Alice        _   NaN

In [132]:
df["Age"]=df["Age"].fillna(df["Age"].mean(skipna=True))

In [133]:
df

    Name Location   Age
a    NaN  Nairobi  20.0
b   Jane      msa  30.0
c  Alice        _  25.0

In [134]:
import numpy as np

In [136]:
df= pd.DataFrame({
    "Name":[np.NaN,"Jane","Alice"],
    "Location":["Nairobi",np.NaN,"_"],
    "Age":[20,30,np.NaN]
},index=["a","b","c"])

In [137]:
df

    Name Location   Age
a    NaN  Nairobi  20.0
b   Jane      NaN  30.0
c  Alice        _   NaN

In [145]:
df.dropna(how="any",inplace=True)

In [144]:
df

Empty DataFrame
Columns: [Name, Location, Age]
Index: []

In [148]:
df.replace({"_":"nairobi"})

Empty DataFrame
Columns: [Name, Location, Age]
Index: []

In [147]:
df

Empty DataFrame
Columns: [Name, Location, Age]
Index: []

In [150]:
df=pd.read_csv("houseprices.csv")

In [149]:
import pandas as pd

In [151]:
df

,city,area,rooms,bathroom,parking spaces,floor,animal,furniture,hoa (R$),rent amount (R$),property tax (R$),fire insurance (R$),total (R$)
0,São Paulo,70,2,1,1,7,acept,furnished,2065,3300,211,42,5618
1,São Paulo,320,4,4,0,20,acept,not furnished,1200,4960,1750,63,7973
2,Porto Alegre,80,1,1,1,6,acept,not furnished,1000,2800,0,41,3841
3,Porto Alegre,51,2,1,0,2,acept,not furnished,270,1112,22,17,1421
4,São Paulo,25,1,1,0,1,not acept,not furnished,0,800,25,11,836
...,...,...,...,...,...,...,...,...,...,...,...,...,...
10687,Porto Alegre,63,2,1,1,5,not acept,furnished,402,1478,24,22,1926
10688,São Paulo,285,4,4,4,17,acept,not furnished,3100,15000,973,191,19260
10689,Rio de Janeiro,70,3,3,0,8,not acept,furnished,980,6000,332,78,7390
10690,Rio de Janeiro,120,2,2,2,8,acept,furnished,1585,12000,279,155,14020
10691,São Paulo,80,2,1,0,-,acept,not furnished,0,1400,165,22,1587

In [152]:
df.head()

,city,area,rooms,bathroom,parking spaces,floor,animal,furniture,hoa (R$),rent amount (R$),property tax (R$),fire insurance (R$),total (R$)
0,São Paulo,70,2,1,1,7,acept,furnished,2065,3300,211,42,5618
1,São Paulo,320,4,4,0,20,acept,not furnished,1200,4960,1750,63,7973
2,Porto Alegre,80,1,1,1,6,acept,not furnished,1000,2800,0,41,3841
3,Porto Alegre,51,2,1,0,2,acept,not furnished,270,1112,22,17,1421
4,São Paulo,25,1,1,0,1,not acept,not furnished,0,800,25,11,836

In [153]:
gb=df.groupby("floor")

In [154]:
gb

In [155]:
gb.sum()

,area,rooms,bathroom,parking spaces,hoa (R$),rent amount (R$),property tax (R$),fire insurance (R$),total (R$)
floor,,,,,,,,,
-,570022,7516,6956,5976,331523,12172958,1083264,187519,13775592
1,104547,2346,1903,1153,990470,3075285,239659,40133,4346074
10,45986,892,830,554,533751,1427567,139966,18417,2119720
11,82581,695,647,427,389681,1235192,127198,15929,1768000
12,58251,620,604,407,372612,1145150,117106,14763,1649669
13,26615,496,472,340,278241,919672,89642,11810,1299351
14,21663,405,412,272,239616,787653,55120,10067,1092475
15,22565,372,377,286,221424,730129,68777,9398,1029759
16,14703,264,263,195,157602,511283,49698,6567,725157
17,16251,261,262,207,181042,554724,59459,7089,802306
18,9564,176,187,137,100236,394713,29166,5053,529177
19,8192,128,141,111,90150,292916,33104,3651,419819
2,95937,2223,1779,1040,841049,2650192,198608,34863,3725069
20,7637,117,131,103,76880,274947,27123,3502,382472
21,8141,112,124,98,90032,292646,33285,3675,419645
22,4395,69,78,65,48066,144567,17965,1854,212471
23,3436,62,65,44,36953,131595,12583,1689,182821
24,2095,43,44,32,20537,90947,9118,1163,121773
25,1489,36,37,29,18223,97086,3564,1242,120144
26,1452,32,37,29,19872,80040,5926,1036,106880
27,919,16,16,13,11671,61618,2513,786,76587
28,1349,17,24,22,15423,50900,6774,649,73743
29,877,12,14,14,9796,43940,4001,569,58308
3,109487,2161,1710,1087,854136,2683715,197993,35374,3771327
301,80,3,2,2,750,2600,164,35,3549
32,135,3,4,2,1279,11750,487,150,13666
35,250,3,2,3,2500,15000,1084,191,18780
4,80083,1748,1488,976,3020107,2380020,195088,30964,5626797
46,353,4,5,5,3000,10000,0,127,13130
5,69176,1429,1239,802,733751,2143549,173283,27781,3078398
51,64,2,2,2,800,1900,129,25,2854
6,58293,1258,1117,737,822882,1908779,473555,24818,3230045
7,59551,1218,1082,735,875722,1881522,158404,24378,2940073
8,62773,1183,1070,758,666084,1939186,178051,25074,2808414
9,46526,873,792,542,496779,1514934,128946,19552,2160242

## $$ \text{Percentage missing} = \frac{\text{missing values}}{\text{total values}} * 100 $$

In [158]:
import numpy as np

In [198]:
import pandas as pd

In [199]:
df= pd.DataFrame({
    "Name":["Vero","Jane","Alice","Laura"],
    "Location":["Nairobi","Kisumu","Mombasa","Nakuru"],
    "Age":[20,30,np.NaN,40]
},index=["a","b","c","d"])

In [200]:
df

    Name Location   Age
a   Vero  Nairobi  20.0
b   Jane   Kisumu  30.0
c  Alice  Mombasa   NaN
d  Laura   Nakuru  40.0

In [201]:
from sklearn.impute import SimpleImputer

In [202]:
simple_imputer = SimpleImputer(missing_values = np.NaN, strategy = "mean")

In [203]:
df

    Name Location   Age
a   Vero  Nairobi  20.0
b   Jane   Kisumu  30.0
c  Alice  Mombasa   NaN
d  Laura   Nakuru  40.0

In [204]:
df.isna()

    Name  Location    Age
a  False     False  False
b  False     False  False
c  False     False   True
d  False     False  False

In [205]:
df.isna().sum()

Name        0
Location    0
Age         1
dtype: int64

In [223]:
df_table=df.copy()

In [224]:
df_table["Äge"]=simple_imputer.fit_transform(df["Age"].values.reshape(-1,1))

In [225]:
df_table

    Name Location   Age   Äge
a   Vero  Nairobi  20.0  20.0
b   Jane   Kisumu  30.0  30.0
c  Alice  Mombasa   NaN  30.0
d  Laura   Nakuru  40.0  40.0

In [212]:
from sklearn.experimental import enable_iterative_imputer
from sklearn.impute import IterativeImputer

In [215]:
iter_imputer=IterativeImputer(max_iter=10 ,random_state=0)

In [216]:
iter_imputer.fit([[12,15],[23,30],[30,np.NaN],[45,np.NaN]])

IterativeImputer(random_state=0)

In [217]:
IterativeImputer(random_state=0)

IterativeImputer(random_state=0)

In [218]:
x_test=[[30,32],[35,np.NaN],[np.NaN,55],[60,70]]

In [219]:
iter_imputer.transform(x_test)

array([[30.        , 32.        ],
       [35.        , 46.36363594],
       [41.33333371, 55.        ],
       [60.        , 70.        ]])